package com.example.tourist.util;

/**
 * Класс, содержащий сообщения, используемые для работы с адресами.
 * Используется для централизованного хранения строковых сообщений, связанных с адресами.
 * Это позволяет избежать повторения строковых значений в разных частях приложения и облегчить их изменение.
 */
public class AddressMessages {

    /**
     * Сообщение, которое будет использовано, когда адрес не найден.
     * Используется в исключениях или логах, чтобы информировать о проблемах с поиском адреса.
     */
    public static final String ADDRESS_NOT_FOUND_MESSAGE = "Address not found";
}
