package com.example.tourist.util;

/**
 * Класс, содержащий сообщения, используемые для работы с достопримечательностями.
 * Этот класс служит для централизованного хранения строковых сообщений, связанных с достопримечательностями.
 * Он позволяет избежать повторения строковых значений и упрощает их изменение в случае необходимости.
 */
public class AttractionMessages {

    /**
     * Сообщение, которое будет использовано, когда достопримечательность не найдена.
     * Это сообщение может использоваться в исключениях или логах для информирования о проблемах с поиском достопримечательности.
     */
    public static final String ATTRACTION_NOT_FOUND_MESSAGE = "Attraction not found";
}
