package com.example.tourist.util;

/**
 * Класс, содержащий сообщения, используемые для работы с поставщиками услуг.
 * Этот класс служит для централизованного хранения строковых сообщений, связанных с поставщиками.
 * Он позволяет избежать повторения строковых значений и упрощает их изменение в случае необходимости.
 */
public class ProviderMessages {

    /**
     * Сообщение, которое будет использовано, когда поставщик услуг не найден.
     * Это сообщение может использоваться в исключениях или логах для информирования о проблемах с поиском поставщика.
     */
    public static final String PROVIDER_NOT_FOUND_MESSAGE = "Provider not found";
}